Repository: labilezhu/graphql-java-i18n-zh_cn
Catalog: translate-omegat.tmx
Source language: en_us
Languages: zh_cn

source: ``graphql.execution.instrumentation.fieldvalidation.FieldValidationInstrumentation`` is an ``Instrumentation`` implementation that can be used to validate fields and their arguments before query execution.
zh_cn: ``graphql.execution.instrumentation.fieldvalidation.FieldValidationInstrumentation`` 拦截器，可以在执行查询前校验字段和字段参数。

source: ``graphql.execution.instrumentation.tracing.TracingInstrumentation`` is an ``Instrumentation`` implementation that creates tracing information about the query that is being executed.
zh_cn: ``graphql.execution.instrumentation.tracing.TracingInstrumentation`` 是一个可以收集跟踪信息的拦截器。

source: graphql subscriptions allow a stream of ``ExecutionResult`` objects to be sent down each time the stock price changes.
zh_cn: 股票价格变化时，graphql 订阅 可以把 ``ExecutionResult`` 对象以流的方式传送给订阅者。

source: graphql-java gives you a way to map the graphql query fields over that stream of objects just like a standard graphql query.
zh_cn: graphql-java 会帮助你从流对象中获取 graphql 字段（fields）。像一般的 graphql 查询一样。

source: graphql-java only produces a stream of results.
zh_cn: graphql-java 只是产出一个流对象。

source: graphql-java uses fully asynchronous execution techniques when it executes queries.
zh_cn: graphql-java 是个全异步的执行引擎.

source: is thrown as a general purpose runtime exception, for example if the code cant access a named field when examining a POJO, it is analogous to a RuntimeException if you will.
zh_cn: 这个是通用的异常。如不能访问 POJO 的 field。这可以等同于 RuntimeException。

source: is thrown as a low level code assertion exception for truly unexpected code conditions, things we assert
zh_cn: 这是内部断言的预计外异常

source: is thrown if a graphql.schema.TypeResolver` fails to provide a concrete object type given a interface or union type.
zh_cn: 当 graphql.schema.TypeResolver` 不能判断抽象对象（ interface or union type） 的实际类型（ concrete object type） 时发生这个异常。

source: is thrown if a map used for an input type object contains more keys than is defined in that input type.
zh_cn: 可以输入对象（ input type object ）包含了未在Schema中定义的field。就会发生上面异常。

source: is thrown if a non null variable argument is coerced as a null value during execution.
zh_cn: 如果 个不允许为 null 的参数，被赋值为 null。会抛出上面异常。.

source: is thrown if the schema is not valid when built via
zh_cn: 表示在运行下面函数时， Schema 校验失败。

source: is thrown when a value cannot be parsed by a Scalar type, for example a String input value being parsed as an Int.
zh_cn: 发生这类型的异常，原因是解释输入的 Scalar 时出错 ，如 int 参数的实际输入值是一个 String。

source: is thrown when a value cannot be serialised by a Scalar type, for example a String value being coerced as an Int.
zh_cn: 发生这类型的异常，原因是序列化Scalar时出错。如 Int 字段获取到 String 值。

source: on how BatchedExecutionStrategy works here.
zh_cn: 关于 BatchedExecutionStrategy 是如何工作的。

source: should never happen in practice.
zh_cn: 事实上不应该发生【译注：如果抛出了，可能是框架有BUG了。】

source: with variables:
zh_cn: 带上参数（ variables）：
